# --------------------------- Homework_6.1  ------------------------------------
"""
Виконав: Григорій Чернолуцький
Homework_9

Знаходження чисел Фібоначчі
формування нормального закону розподілу випадкової величини,
як адитивна суміш двох рівномірних законів за принципами циклічних повторень.

Package Version
------- -------
pip 24.3.1

"""

from fibonacci import fibonacci_main
from random_norm import rand_norm_main


def main() -> None:
    # fibonacci_main(int(input(" Введіть кількість чисел Фібоначчі ->")))
    rand_norm_main()


# --------------------------------- main module ----------------------------------------------
if __name__ == '__main__':
    main()

''' 
РЕЗУЛЬТАТ

Введіть кількість чисел Фібоначчі ->40
Вхідні параметри хибні, корегую....
Обчислення ряду чисел Фібоначчі:
0 1 1 2 3 5 8 13 21 34 55 89 144 233 377 610 987 1597 2584 4181 6765 10946 17711 28657 46368 75025 121393 196418 317811 514229 832040 1346269 2178309 3524578 5702887  
0 1 1 2 3 5 8 13 21 34 55 89 144 233 377 610 987 1597 2584 4181 6765 10946 17711 28657 46368 75025 121393 196418 317811 514229 832040 1346269 2178309 3524578 5702887  
0 1 1 2 3 5 8 13 21 34 55 89 144 233 377 610 987 1597 2584 4181 6765 10946 17711 28657 46368 75025 121393 196418 317811 514229 832040 1346269 2178309 3524578 5702887  
0 1 1 2 3 5 8 13 21 34 55 89 144 233 377 610 987 1597 2584 4181 6765 10946 17711 28657 46368 75025 121393 196418 317811 514229 832040 1346269 2178309 3524578 5702887  




'''
