# --------------------------- Homework_6.1  ------------------------------------
"""
Виконав: Григорій Чернолуцький
Homework_9

Package Version
------- -------
pip 24.3.1

"""

from hw_9_1_fibonacci import fibonacci
from hw_9_2_rand_norm import rand_norm


def main() -> None:
    fibonacci(int(input(" Введіть кількість чисел Фібоначчі ->")))
    rand_norm()


# --------------------------------- main module ----------------------------------------------
if __name__ == '__main__':
    main()

''' 
РЕЗУЛЬТАТ

Введіть кількість чисел Фібоначчі ->40
Вхідні параметри хибні, корегую....
Обчислення ряду чисел Фібоначчі:
0 1 1 2 3 5 8 13 21 34 55 89 144 233 377 610 987 1597 2584 4181 6765 10946 17711 28657 46368 75025 121393 196418 317811 514229 832040 1346269 2178309 3524578 5702887  
0 1 1 2 3 5 8 13 21 34 55 89 144 233 377 610 987 1597 2584 4181 6765 10946 17711 28657 46368 75025 121393 196418 317811 514229 832040 1346269 2178309 3524578 5702887  




'''
